app/Controllers/admin/AnggotaController.php

    public function index()
    {
        $anggotaModel = new AnggotaModel();
        $keyword = $this->request->getGet('keyword'); // Ambil keyword dari URL

        $data = [
            'title' => 'Daftar Anggota DPR',
            'keyword' => $keyword, // Kirim keyword ke view
        ];

        if ($keyword) {
            $data['anggota'] = $anggotaModel->search($keyword);
---
SELECT *
FROM `anggota`