app/Controllers/admin/KomponenGajiController.php

SELECT *
FROM `komponen_gaji`
---
    public function index()
    {
        $komponenGajiModel = new KomponenGajiModel();
        $keyword = $this->request->getGet('keyword');

        $data = [
            'title' => 'Daftar Komponen Gaji & Tunjangan',
            'keyword' => $keyword,
        ];

        if ($keyword) {
            $data['komponen_gaji'] = $komponenGajiModel->search($keyword);

INSERT INTO `komponen_gaji` (`nama_komponen`, `kategori`, `jabatan`, `nominal`, `satuan`) VALUES ('Uang Makan', 'Tunjangan Lain', 'Anggota', '50000', 'Hari')
---
    public function store()
    {
        $komponenGajiModel = new KomponenGajiModel();

        // Aturan validasi
        $rules = [
            'nama_komponen' => 'required|min_length[3]',
            'kategori' => 'required|in_list[Gaji Pokok,Tunjangan Melekat,Tunjangan Lain]',
            'jabatan' => 'required|in_list[Ketua,Wakil Ketua,Anggota,Semua]',
            'nominal' => 'required|numeric',
            'satuan' => 'required|in_list[Bulan,Hari,Periode]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Jika validasi berhasil, simpan data
        $data = [
            'nama_komponen' => $this->request->getPost('nama_komponen'),
            'kategori' => $this->request->getPost('kategori'),
            'jabatan' => $this->request->getPost('jabatan'),
            'nominal' => $this->request->getPost('nominal'),
            'satuan' => $this->request->getPost('satuan'),
        ];

        $komponenGajiModel->save($data);

DELETE FROM `komponen_gaji`
WHERE `id_komponen_gaji` IN ('204')
---
    public function delete($id = null)
    {
        $komponenGajiModel = new KomponenGajiModel();

        $data = $komponenGajiModel->find($id);
        if ($data) {
            $komponenGajiModel->delete($id);