app/Controllers/admin/PenggajianController.php

SELECT *
FROM `anggota`
SELECT *
FROM `komponen_gaji`
---
    public function create()
    {
        $anggotaModel = new AnggotaModel();
        $komponenGajiModel = new KomponenGajiModel();

        $data = [
            'title' => 'Form Tambah Data Penggajian',
            'anggota' => $anggotaModel->findAll(),
            'komponen_gaji' => $komponenGajiModel->findAll(),
        ];

SELECT *
FROM `anggota`
WHERE `anggota`.`id_anggota` = '109'
---
    public function detail($id_anggota = null)
    {
        $anggotaModel = new AnggotaModel();
        $penggajianModel = new PenggajianModel();

        $anggota = $anggotaModel->find($id_anggota);