app/Controllers/PublicController.php

    public function anggota()
    {
        $anggotaModel = new AnggotaModel();
        $data = [
            'title' => 'Daftar Anggota DPR RI',
            'anggota' => $anggotaModel->findAll(),
---
SELECT *
FROM `anggota`