app/Models/PenggajianModel.php

SELECT `a`.`id_anggota`, `a`.`gelar_depan`, `a`.`nama_depan`, `a`.`nama_belakang`, `a`.`gelar_belakang`, `a`.`jabatan`, `a`.`status_pernikahan`, `a`.`jumlah_anak`, (SELECT SUM(
                    CASE
                        WHEN k.nama_komponen = 'Tunjangan Istri/Suami' AND a.status_pernikahan != 'Kawin' THEN 0
                        WHEN k.nama_komponen = 'Tunjangan Anak' AND a.jumlah_anak = 0 THEN 0
                        WHEN k.nama_komponen = 'Tunjangan Anak' AND a.jumlah_anak > 0 THEN k.nominal * LEAST(a.jumlah_anak, 2)
                        ELSE k.nominal
                    END
                )
FROM `penggajian` `p`
JOIN `komponen_gaji` `k` ON `p`.`id_komponen_gaji` = `k`.`id_komponen_gaji`
WHERE `p`.`id_anggota` = `a`.`id_anggota`
AND `k`.`satuan` = 'Bulan') as take_home_pay
FROM `anggota` `a`
SELECT `a`.`id_anggota`, `a`.`gelar_depan`, `a`.`nama_depan`, `a`.`nama_belakang`, `a`.`gelar_belakang`, `a`.`jabatan`, `a`.`status_pernikahan`, `a`.`jumlah_anak`, (SELECT SUM(
                CASE
                    WHEN k.nama_komponen = 'Tunjangan Istri/Suami' AND a.status_pernikahan != 'Kawin' THEN 0
                    WHEN k.nama_komponen = 'Tunjangan Anak' AND a.jumlah_anak = 0 THEN 0
                    WHEN k.nama_komponen = 'Tunjangan Anak' AND a.jumlah_anak > 0 THEN k.nominal * LEAST(a.jumlah_anak, 2)
                    ELSE k.nominal
                END
            )
FROM `penggajian` `p`
JOIN `komponen_gaji` `k` ON `p`.`id_komponen_gaji` = `k`.`id_komponen_gaji`
WHERE `p`.`id_anggota` = `a`.`id_anggota`
AND `k`.`satuan` = 'Bulan') as take_home_pay
FROM `anggota` `a`
---
    public function getPenggajian()
    {
        $builder = $this->db->table('anggota a');
        $builder->select("
            a.id_anggota, a.gelar_depan, a.nama_depan, a.nama_belakang, a.gelar_belakang,
            a.jabatan, a.status_pernikahan, a.jumlah_anak
        ");

        $subQuery = $this->db->table('penggajian p')
            ->join('komponen_gaji k', 'p.id_komponen_gaji = k.id_komponen_gaji')
            ->select("
                SUM(
                    CASE
                        WHEN k.nama_komponen = 'Tunjangan Istri/Suami' AND a.status_pernikahan != 'Kawin' THEN 0
                        WHEN k.nama_komponen = 'Tunjangan Anak' AND a.jumlah_anak = 0 THEN 0
                        WHEN k.nama_komponen = 'Tunjangan Anak' AND a.jumlah_anak > 0 THEN k.nominal * LEAST(a.jumlah_anak, 2)
                        ELSE k.nominal
                    END
                )
            ")
            ->where('p.id_anggota = a.id_anggota')
            ->where('k.satuan', 'Bulan')
            ->getCompiledSelect();

        $builder->select("({$subQuery}) as take_home_pay");

        $query = $builder->get();
        return $query->getResultArray();

SELECT *
FROM `penggajian` `p`
JOIN `komponen_gaji` `k` ON `p`.`id_komponen_gaji` = `k`.`id_komponen_gaji`
WHERE `p`.`id_anggota` = '109'
---
    public function getDetailKomponen($id_anggota)
    {
        return $this->db->table('penggajian p')
            ->join('komponen_gaji k', 'p.id_komponen_gaji = k.id_komponen_gaji')
            ->where('p.id_anggota', $id_anggota)
            ->get()
            ->getResultArray();