app/Models/PenggunaModel.php

    public function getUserByUsername($username) {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `pengguna`
WHERE `username` = 'citizen'
 LIMIT 1